[
  {
    "name": "WeatherTracks",
    "description": "WeatherTracks is an MVP that curates Spotify playlists tailored to the current weather in a user's location. By integrating the OpenWeatherMap API for real-time weather data, the Spotify API for playlist generation, and The Noun Project for high-quality icons, WeatherTracks provides a personalized music experience based on local weather conditions.",
    "features": [
      "Design",
      "API Integration",
      "JavaScript/Gatsby Development"
    ],
    "image": "/projects/weathertracks.jpg",
    "link": "https://weathertracks.netlify.app"
  },
  {
    "name": "Craft Brew",
    "description": "Craft Brew was a prototype web application that allowed users to search for breweries by city and state. Users can also view details about each brewery, including the brewery's name, address, phone number, and website.",
    "features": [
      "Design",
      "Craft CMS Development"
    ],
    "image": "/projects/craft-brew.jpg"
  },
  {
    "name": "Henco Reprographics",
    "description": "Henco Reprographics is a WordPress website created for a local business specializing in printing and reprography services. Users can explore the range of services offered and conveniently request a customized quote by uploading their documents for print evaluation.",
    "features": [
      "Design",
      "WordPress Development"
    ],
    "image": "/projects/hencoreprographics.jpg",
    "link": "http://hencorepro.com/"
  },
  {
    "name": "Trinity United Methodist Church",
    "description": "Trinity United Methodist Church is a Drupal 7 website that provides information on the church's services and events.",
    "features": [
      "Design",
      "Full-service Branding",
      "Drupal 7 Development"
    ],
    "image": "/projects/trinitywavl.jpg"
  },
  {
    "name": "Program Services",
    "description": "Program Services is a Ruby on Rails application that provides quality continuing education courses for mental health professionals.",
    "features": [
      "Design",
      "Participatory Ruby on Rails Development"
    ],
    "image": "/projects/program-services.jpg",
    "link": "https://programservices.com/"
  },
  {
    "name": "Sign The Climate Agreement",
    "description": "Sign The Climate Agreement was a Drupal 7 website that allowed users to sign a petition to support the Paris Climate Agreement and share to a user's desired social platform.",
    "features": [
      "Design",
      "API Integration",
      "Participatory Drupal 7 development"
    ],
    "image": "/projects/signtheagreement.jpg"
  },
  {
    "name": "Deerwood Homeowners Association",
    "description": "Deerwood Homeowners Association was a WordPress website that provided information on the association's services and events.",
    "features": [
      "Design",
      "WordPress Development"
    ],
    "image": "/projects/deerwood.jpg"
  },
  {
    "name": "Hogue Furniture Design",
    "description": "Hogue Furniture Design was a Drupal 7 website that provided information on the company's furniture design services and products.",
    "features": [
      "Design Implementation",
      "Drupal 7 Development"
    ],
    "image": "/projects/hoguesf.jpg"
  }
]
